src/cf/Documents/уатНачислениеПремий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатНачислениеПремий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.уатОсновныеНачисления</xr:Item>
				<xr:Item>AccumulationRegister.уатРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПланыПримененияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма премий в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МотивПоощрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоощрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТарифыЗП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВидыЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыЗатрат</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Амортизация</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЖ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ремонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаРасходныхМатериалов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеАгрегатов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеМатериаловНаПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатНачислениеПремий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатНачислениеПремий";
	КомандаПечати.Идентификатор  = "Т11";
	КомандаПечати.Представление  = НСтр("en='T-11';ru='Приказ о поощрении (Т-11)'");
	КомандаПечати.Порядок        = 1;
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Т11") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Т11", "Т-11", уатПечать_Т11(МассивОбъектов, ОбъектыПечати));
	Иначе
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
	уатУправлениеПечатью.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры // Печать

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	СформироватьТаблицаОсновныеНачисления(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасходы(ДокументСсылка, СтруктураДополнительныеСвойства);
КонецПроцедуры

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	Заглушка = Истина;
КонецПроцедуры

// Получает дополнительные реквизиты для отображения в отчете "Реестр документов"
// 
// Возвращаемое значение:
//  Структура - доп. реквизитов
//
Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "Контрагент");
	Возврат Результат;
	
КонецФункции

// Формирует печатную форму Т-11
//
// Параметры:
//  ИмяМакета - табличный документ
Функция уатПечать_Т11(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеПремий";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатНачислениеПремий.ПФ_MXL_Т11");
	
	мВалютаУпрУчета = Константы.ВалютаУправленческогоУчета.Получить();
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Приказ");
		
		СписокТребуемыхПараметров = "НаименованиеДляПечатныхФорм, ОКПО";
		СведенияОбОрганизации     = уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(ТекущийДокумент.Организация);
		ОбластьМакета.Параметры.РаботаОрганизацияНаименованиеСокращенное =
			уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(СведенияОбОрганизации, СписокТребуемыхПараметров);
		ОбластьМакета.Параметры.РаботаОрганизацияКодПоОКПО = СведенияОбОрганизации.КодПоОКПО;
		
		ПечатьПрефиксовВключена = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ТекущийДокумент.Организация,
			ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ВыводитьПрефиксПриПечати"));
		Если ПечатьПрефиксовВключена Тогда
			ОбластьМакета.Параметры.СсылкаНаОбъектНомерНаПечать = ТекущийДокумент.Номер;
		Иначе
			ОбластьМакета.Параметры.СсылкаНаОбъектНомерНаПечать = уатОбщегоНазначенияКлиентСервер.НомерДокументаНаПечать(
				ТекущийДокумент.Номер, Истина, Истина);
		КонецЕсли;
		
		ОбластьМакета.Параметры.СсылкаНаОбъектДатаНаПечать = ТекущийДокумент.Дата;
		
		РеквизитыВодителя = уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(
			ТекущийДокумент.Сотрудник, ТекущийДокумент.Дата, ТекущийДокумент.Организация);
		ДолжностьВодителя = СокрЛП(РеквизитыВодителя.Должность);
		
		Если ЗначениеЗаполнено(ТекущийДокумент.Сотрудник.ФизическоеЛицо) Тогда
			ФИОФизЛица = уатОбщегоНазначения.уатФИОФизЛица(ТекущийДокумент.Сотрудник.ФизическоеЛицо, ТекущийДокумент.Дата);
			
			Если ФИОФизЛица = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ФИОФизЛица.Фамилия) Тогда
				ФИОПолные = ТекущийДокумент.Сотрудник.Наименование;
			Иначе
				ФИОПолные = ФИОФизЛица.Фамилия + " " + ФИОФизЛица.Имя + " " + ФИОФизЛица.Отчество;
			КонецЕсли;
			Если ТекущийДокумент.Сотрудник.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				мПол = 1;
			ИначеЕсли ТекущийДокумент.Сотрудник.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				мПол = 2;
			Иначе
				мПол = Неопределено;
			КонецЕсли;

			ФИОВодителя = СклонениеПредставленийОбъектов.ПросклонятьФИО(СокрЛП(ФИОПолные), 2,, мПол);
		Иначе
			ФИОВодителя = СклонениеПредставленийОбъектов.ПросклонятьФИО(СокрЛП(ТекущийДокумент.Сотрудник.Наименование), 2,, Неопределено);
		КонецЕсли;
		ОбластьМакета.Параметры.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже = ФИОВодителя;
		ОбластьМакета.Параметры.РаботаДолжность = ДолжностьВодителя;
		ОбластьМакета.Параметры.РаботаСотрудникТабельныйНомерНаПечать = ТекущийДокумент.Сотрудник.Код;
		ОбластьМакета.Параметры.РаботаПодразделениеНаПечать = ТекущийДокумент.Подразделение;
		ОбластьМакета.Параметры.СсылкаНаОбъектМотивПоощрения = ТекущийДокумент.МотивПоощрения;
		ОбластьМакета.Параметры.СсылкаНаОбъектВидПоощренияНаПечать = ТекущийДокумент.ВидПоощрения;
		ОбластьМакета.Параметры.ДанныеПоощренияСуммаПоощренияПрописью =
			уатОбщегоНазначенияТиповые.уатСформироватьСуммуПрописью(ТекущийДокумент.СуммаДокумента, мВалютаУпрУчета);
		ОбластьМакета.Параметры.ДанныеПоощренияРезультатНаПечать = уатОбщегоНазначенияТиповые.уатФорматСумм(
			ТекущийДокумент.СуммаДокумента, мВалютаУпрУчета);
		
		Руководители = уатОбщегоНазначенияТиповые.уатОтветственныеЛицаОрганизаций(
			ТекущийДокумент.Организация, ТекущийДокумент.Дата);
		ОбластьМакета.Параметры.СсылкаНаОбъектДолжностьРуководителя          = Руководители.РуководительДолжность;
		ОбластьМакета.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи =
			уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Руководители.Руководитель);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура СформироватьТаблицаОсновныеНачисления(ДокументСсылка, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПремияНачисления.Ссылка КАК Ссылка,
	|	уатПремияНачисления.Ссылка.ПериодНачисления КАК Период,
	|	уатПремияНачисления.Ссылка.ПериодНачисления КАК ПериодРегистрации,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	уатПремияНачисления.Ссылка.ПериодНачисления КАК БазовыйПериодНачало,
	|	уатПремияНачисления.Ссылка.ПериодНачисления КАК БазовыйПериодКонец,
	|	уатПремияНачисления.Ссылка.Организация КАК Организация,
	|	уатПремияНачисления.Ссылка.Подразделение КАК Подразделение,
	|	уатПремияНачисления.Ссылка.Сотрудник КАК Сотрудник,
	|	уатПремияНачисления.Начисление КАК ВидРасчета,
	|	СУММА(уатПремияНачисления.Сумма) КАК Результат,
	|	уатПремияНачисления.Тариф КАК Тариф,
	|	уатПремияНачисления.ТС КАК ТС
	|ИЗ
	|	Документ.уатНачислениеПремий.Начисления КАК уатПремияНачисления
	|ГДЕ
	|	уатПремияНачисления.Ссылка = &Док
	|
	|СГРУППИРОВАТЬ ПО
	|	уатПремияНачисления.Ссылка,
	|	уатПремияНачисления.Начисление,
	|	уатПремияНачисления.Ссылка.ПериодНачисления,
	|	уатПремияНачисления.Ссылка.Организация,
	|	уатПремияНачисления.Ссылка.Подразделение,
	|	уатПремияНачисления.Ссылка.Сотрудник,
	|	уатПремияНачисления.Тариф,
	|	уатПремияНачисления.Ссылка.ПериодНачисления,
	|	уатПремияНачисления.Ссылка.ПериодНачисления,
	|	уатПремияНачисления.Ссылка.ПериодНачисления,
	|	уатПремияНачисления.ТС");
	Запрос.УстановитьПараметр("Док", ДокументСсылка);
	мТаблица = Запрос.Выполнить().Выгрузить();
	
	флНачислятьПоПодразделениюСотрудника = НЕ уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.НачислятьЗарплатуПоПодразделениюДокумента);
	Если флНачислятьПоПодразделениюСотрудника Тогда
		РеквизитыВодителя = уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(
			ДокументСсылка.Сотрудник, ДокументСсылка.ПериодНачисления, ДокументСсылка.Организация);
		Для Каждого ТекСтрока Из мТаблица Цикл
			ТекСтрока.Подразделение = РеквизитыВодителя.ПодразделениеОрганизации;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОсновныхНачислений", мТаблица);
КонецПроцедуры

Процедура СформироватьТаблицаРасходы(ДокументСсылка, СтруктураДополнительныеСвойства)
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьУчетДоходовИРасходов") = ЛОЖЬ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПремияНачисления.Ссылка КАК Регистратор,
	|	уатПремияНачисления.Ссылка.ПериодНачисления КАК Период,
	|	&СтатьяРасходовЗП КАК СтатьяРасходов,
	|	уатПремияНачисления.Ссылка.Организация КАК Организация,
	|	уатПремияНачисления.Ссылка.Подразделение КАК Подразделение,
	|	уатПремияНачисления.Ссылка.Сотрудник КАК Сотрудник,
	|	уатПремияНачисления.ТС КАК ТС,
	|	уатПремияНачисления.Сумма КАК СуммаУпр,
	|	0 КАК СуммаРегл
	|ИЗ
	|	Документ.уатНачислениеПремий.Начисления КАК уатПремияНачисления
	|ГДЕ
	|	уатПремияНачисления.Ссылка = &Док");
	Запрос.УстановитьПараметр("Док", ДокументСсылка);
	Запрос.УстановитьПараметр("СтатьяРасходовЗП", уатОбщегоНазначения.НайтиСтатьюЗатрат(ДокументСсылка.ПланЗатрат,
		Перечисления.уатВидыЗатрат.ОплатаТруда));
	ТаблицаРасходы = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из ТаблицаРасходы Цикл
		ТекСтрока.СуммаРегл = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаУпр,
			СтруктураДополнительныеСвойства.ВалютаУпрУчета, СтруктураДополнительныеСвойства.ВалютаРеглУчета,
			СтруктураДополнительныеСвойства.КурсУпр,        СтруктураДополнительныеСвойства.КурсРегл,
			СтруктураДополнительныеСвойства.КратностьУпр,   СтруктураДополнительныеСвойства.КратностьРегл,,
			ДокументСсылка);
	КонецЦикла;
		
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходы", ТаблицаРасходы);
КонецПроцедуры

#КонецОбласти


#КонецЕсли
